Revit 2027 API
IFCProductWrapper.ClearFinishMaterials Method
 Clear finish materials in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearFinishMaterials()
Public Sub ClearFinishMaterials
public:
void ClearFinishMaterials()
member ClearFinishMaterials : unit -> unit
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace